LiteOS/LiteOS/GD32F207_Library/gd32f20x_conf.h
/**
  ******************************************************************************
  * @file    SysTick/Systick_demo/gd32f20x_conf.h
  * @author  MCU SD
  * @version V1.0.0
  * @date    15-Jul-2015
  * @brief   Configuration file.
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GD32F20x_CONF_H
#define __GD32F20x_CONF_H

/* Includes ------------------------------------------------------------------*/
/* Comment the line below to disable peripheral header file inclusion */
#include "gd32f20x_adc.h"
#include "gd32f20x_bkp.h"
#include "gd32f20x_can.h"
#include "gd32f20x_crc.h"
#include "gd32f20x_cryp.h"
#include "gd32f20x_dac.h"
#include "gd32f20x_dci.h"
#include "gd32f20x_dma.h"
#include "gd32f20x_eth.h"
#include "gd32f20x_exmc.h"
#include "gd32f20x_exti.h"
#include "gd32f20x_fmc.h"
#include "gd32f20x_gpio.h"
#include "gd32f20x_hash.h"
#include "gd32f20x_i2c.h"
#include "gd32f20x_iwdg.h"
#include "gd32f20x_mcudbg.h"
#include "gd32f20x_misc.h"
#include "gd32f20x_pwr.h"
#include "gd32f20x_rcc.h"
#include "gd32f20x_rng.h"
#include "gd32f20x_rtc.h"
#include "gd32f20x_sdio.h"
#include "gd32f20x_spi.h"
#include "gd32f20x_timer.h"
#include "gd32f20x_tldi.h"
#include "gd32f20x_usart.h"
#include "gd32f20x_wwdg.h"


#endif /* __GD32F20x_CONF_H */

/******************* (C) COPYRIGHT 2015 GIGADEVICE *****END OF FILE****/
